# Lesson17_Assignment
(nahiyanhkhan@gmail.com)

**Let's assume we have the following DataFrame, which represents information about students' scores:**

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Math Score': [85, 92, 78, 88],
        'English Score': [90, 86, 92, 80]
       }

df = pd.DataFrame(data)

In [3]:
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80

***1) Retrieve the English score of 'Charlie'.***

In [4]:
df.loc[df['Name']=='Charlie', 'English Score'].values[0]

92

***2) Get the Math scores of all students.***

In [5]:
df.loc[:, 'Math Score']

0    85
1    92
2    78
3    88
Name: Math Score, dtype: int64

***3) Access the English score of the first student.***

In [6]:
df.loc[0, 'English Score']

90

***4) Retrieve the Math score of the last student.***

In [7]:
df.loc[df.index[-1], 'Math Score']

88

***5) Update Bob's Math score to 95.***

In [8]:
df.loc[df['Name']=='Bob', 'Math Score'] = 95
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             92
3    David          88             80

***6) Increase Charlie's English score by 5 points.***

In [9]:
df.loc[df['Name']=='Charlie', 'English Score'] += 5
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             97
3    David          88             80

***7) Add a new row for 'Eve' with Math Score 88 and English Score 95.***

In [10]:
df.loc[len(df)] = ['Eve', 88, 95]
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             97
3    David          88             80
4      Eve          88             95

***8) Delete the row for 'David' from the DataFrame.***

In [11]:
df.drop(df.index[df['Name']=='David'].values[0], inplace=True)

In [12]:
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          95             86
2  Charlie          78             97
4      Eve          88             95

***9) Insert a new column called 'Science Score' with values [92, 84, 89, 78].***

In [13]:
df['Science Score'] = [92, 84, 89, 78]
df

      Name  Math Score  English Score  Science Score
0    Alice          85             90             92
1      Bob          95             86             84
2  Charlie          78             97             89
4      Eve          88             95             78

***10) Delete the 'English Score' column from the DataFrame.***

In [14]:
del df['English Score']
df

      Name  Math Score  Science Score
0    Alice          85             92
1      Bob          95             84
2  Charlie          78             89
4      Eve          88             78

***11) Create a new column 'Total Score' that represents the sum of Math Score and English Score for each student.***

In [15]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Math Score': [85, 92, 78, 88],
        'English Score': [90, 86, 92, 80]
       }

df = pd.DataFrame(data)
df

      Name  Math Score  English Score
0    Alice          85             90
1      Bob          92             86
2  Charlie          78             92
3    David          88             80

In [16]:
df['Total Score'] = df['Math Score'] + df['English Score']
df

      Name  Math Score  English Score  Total Score
0    Alice          85             90          175
1      Bob          92             86          178
2  Charlie          78             92          170
3    David          88             80          168

***12) Find the student with the highest Total Score.***

In [17]:
df.loc[df['Total Score'].idxmax(), 'Name']

'Bob'

**Create a second DataFrame with the following data:**

In [18]:
data2 = {'Name': ['Eve', 'Frank'],
        'Math Score': [87, 76],
        'English Score': [94, 82]
        }
df2 = pd.DataFrame(data2)

In [19]:
df2

    Name  Math Score  English Score
0    Eve          87             94
1  Frank          76             82

In [20]:
df2['Total Score'] = df2['Math Score'] + df2['English Score']
df2

    Name  Math Score  English Score  Total Score
0    Eve          87             94          181
1  Frank          76             82          158

***Combine this DataFrame (df2) with the original DataFrame (df) to create a new DataFrame that includes all students.***

In [21]:
merged_df = pd.concat([df, df2], ignore_index=True)
merged_df

      Name  Math Score  English Score  Total Score
0    Alice          85             90          175
1      Bob          92             86          178
2  Charlie          78             92          170
3    David          88             80          168
4      Eve          87             94          181
5    Frank          76             82          158